# 删
## dropna
- 说明：  
    - 删除包含NaN的行或列
    
- 参数： 
    - `axis`：int  
    轴
        - 0：删除行 (默认)
        - 1：删除列
    - `how`: str  
    删除方式
        - 'any'：只要有NaN就删除(默认)
        - 'all'：所有NaN才删除
    - `thresh`: int | None
    删除阈值
        - None: 不考虑这个参数 (默认)
        - int: 每行或每列必须有多少非NA值才会被保留
    - `subset`: scalar | list | None
    考虑的列或行
        - None: 不考虑这个参数 (默认)
        - scalar: 列名或行索引
        - list: 列表中包含的列名或行名
    - `inplace`: bool
    是否修改原DataFrame
        - False: 返回新的DataFrame (默认)
        - True: 修改原DataFrame

In [21]:
import pandas as pd
from numpy import nan

df = pd.DataFrame(
    [
        [None, 2, nan, 0],
        [3, 4, nan, 1], 
        [nan, nan, nan, nan]
    ],
    columns=list("ABCD")
)
df

     A    B   C    D
0  NaN  2.0 NaN  0.0
1  3.0  4.0 NaN  1.0
2  NaN  NaN NaN  NaN

In [22]:
df.dropna(how='all')

     A    B   C    D
0  NaN  2.0 NaN  0.0
1  3.0  4.0 NaN  1.0

In [23]:
df.dropna(thresh=2)

     A    B   C    D
0  NaN  2.0 NaN  0.0
1  3.0  4.0 NaN  1.0

In [24]:
df.dropna(axis=1,subset=1)

     A    B    D
0  NaN  2.0  0.0
1  3.0  4.0  1.0
2  NaN  NaN  NaN

In [25]:
df.dropna(subset=['A','D'])

     A    B   C    D
1  3.0  4.0 NaN  1.0